{
  "name": "James Hayes",
  "phone": "416-575-7301",
  "email": "james.hayes@neolation.com",
  "summary": "Experienced professional computer software developer with the confidence to take on any technological challenge and ensure successful execution. Combining technical experience with interpersonal and teamwork skills has proven to provide effective and scaled task definition and execution. Repeated commendation has been received for high self-initiative and delivery into enterprise.",
  "objective": "My goal is to join a team that collaborates, develops and maintains computer processes with emphasis on quality, security, and cross-platform discipline. I am looking for a company that is seeking help to get things done by leveraging container and cloud technology.",
  "experience": [
    {
      "company": "LaserStyle.me",
      "location": "Hamilton, ON",
      "title": "Freelance Developer",
      "dates": "Apr’23-Jul'23",
      "responsibilities": [
        "Application of full stack technology supporting web services including appointment booking using MongoDB, node.js, express.js, Nginx, Docker CE, GitHub Pages, HTML, CSS, and Javascript. JWT with nodemail.js verification.",
        "Utilizing various public CDN resources, open-source components, and a low-cost high availability architecture."
      ]
    },
    {
      "company": "LaserStyle.me",
      "location": "Hamilton, ON",
      "title": "Freelance Developer",
      "dates": "Apr’23-Jul'23",
      "responsibilities": [
        "Application of full stack technology supporting web services including appointment booking using MongoDB, node.js, express.js, Nginx, Docker CE, GitHub Pages, HTML, CSS, and Javascript. JWT with nodemail.js verification.",
        "Utilizing various public CDN resources, open-source components, and a low-cost high availability architecture."
      ]
    },
    {
      "company": "Datapassports",
      "location": "Toronto, ON",
      "title": "Lead, Devops Engineering",
      "dates": "Feb'22-Jan’23",
      "responsibilities": [
        "Lead team in regard to deployed technologies involving up to seven analysts in Devops, QA and Operations.",
        "Azure and AWS deployment of Spark/Yarn/Hadoop with REST, Kafka, Postgresql, Spring Boot, and Node (NextJs).",
        "Responsible for development support and maintenance of the product delivery pipeline and micro services (Helm-like).",
        "Business plan product definition and high-level architecture was translated into requirements and disseminated (APIM).",
        "Involved with design and prototyping of a proprietary OAuth2 securing Kafka channel; PKI, x.509, TLS/SSL",
        "Technologies: Jenkins, Maven, Java 8, JDBC, BASH, PowerShell, Python, Scala, Javascript, Git, Jira, Artifactory",
        "Docker CE and swarm network using RHEL UBI containers, using Kubernetes investigated e.g. OpenShift, AKS"
      ]
    },
    {
      "company": "Datapassports (formerly Schedule1 Inc.)",
      "location": "Toronto, ON",
      "title": "Devops/Software Developer",
      "dates": "May'18-Feb’22",
      "responsibilities": [
        "Implemented a continuous automated unattended software delivery system using BASH and Python in a Terraform equivalent approach and using Ansible. Used standard Git workflow in practicing an Agile software change process.",
        "Created a packaging framework on AWS enabling delivery of various components in various custom configurations.",
        "Deliver from the pipeline based on building in a container including escrow image retention and third-party verification.",
        "Developed and tested REST API with low latency, high concurrency, and scaled performance e.g.150 req/sec",
        "Integrated hardware cryptography security module using Opencryptoki (C/C++) and z/OS (HSM) as a key vault.",
        "Created automated configuration using AWS/EC2 supporting TLS/SSL for all component communications channels.",
        "Developed a format-preserving encryption (FPE) module in Scala/Java using open-source libraries."
      ]
    },
    {
      "company": "Neolation.com Corp",
      "location": "Mississauga, ON",
      "title": "Full Stack Developer",
      "dates": "May'17-May’18",
      "responsibilities": [
        "Designed and developed a data acquisition and aggregation component supporting product.",
        "A mobile computer application that schedules service bookings is designed and built prototype as single page.",
        "Developed web application with a meAN stack i.e. AngularJS, NodeJS, Nginx, NoSQL as JSON files.",
        "Functional programming design and techniques are applied; secure web services are created."
      ]
    },
    {
      "company": "Telus",
      "location": "Scarborough, ON",
      "title": "Web Developer\nData Analyst",
      "dates": "Oct’16-May'17",
      "responsibilities": [
        "Develop web applications to consolidate and replace existing engineering tools running on desktops.",
        "Utilize a full stack architecture with a JavaScript/JQuery component addressing model concern in browser.",
        "Design and implement deployment processes involving Jira, GIT, MS SQL, Apache, and PHP.",
        "Environment was Agile experience with daily scrums, weekly sprints, and epic project definitions."
      ]
    },
    {
      "company": "ComQi",
      "location": "Burlington, ON",
      "title": "Java Developer/ Data Analyst",
      "dates": "Jun’16-Aug'16",
      "responsibilities": [
        "A commercial HTML5 application with AngularJS and designed for automobile retail required automated processes to be developed supporting the model concern with respect to MVC architectural pattern.",
        "Java classes, Windows batch, and Linux bash scripts perform ETL from RESTful web services then sanitize, transform and serialize to a browser loadable JSON document. Using Microsoft Visual Studio.",
        "Media asset bundles required conversion and packaging to be deployed with the application using Python and .Net C#",
        "Technologies included XMLEncoder, JAXB, and gson fulfilled requirements producing artifacts and documentation e.g. schemagen for XML schema (xsd) and Doxygen. Supported and maintained JBoss-based content server.",
        "Other tools used are Jira, Confluence, GitHub, Subversion (svn), Eclipse, AWS, VirtualBox, Python"
      ]
    },
    {
      "company": "Toyota Motor Manufacturing Canada TMMC",
      "location": "Cambridge, ON",
      "title": "Systems Engineering",
      "dates": "Jul’15-Apr'16",
      "responsibilities": [
        "An upgrade of the Automated Line Control system to a new version running on Redhat Linux with PostgreSQL from HP-UX with Oracle was successfully performed as a contracted member of the systems engineering group providing systems-level support and required program development. Redhat GFS2, 3PAR storage server, and hosted by VMware.",
        "Delivered several critical programs into a near continuous production system including a build and deploy framework supporting bash scripts and C/C++ programs using STL with Subversion.",
        "Built a web Andon; this is a visualization of the status from the various system components and based on cross-domain JQuery and JSON formatted responses. Governed execution of system scripts is provided to many users by a management program that integrates to Apache and any generic HTTP server as a CGI program providing RESTful API web service. Angular JS was being considered a shop standard."
      ]
    },
    {
      "company": "EMC Corporation",
      "location": "Burlington, ON",
      "title": "Senior Software Developer",
      "dates": "Nov ’12-Jul '15",
      "responsibilities": [
        "User interface for recovery of databases or applications from NetWorker backups was developed from functional specification to full implementation. Existing API and framework were reused including layout meta-template, Java control logic, and back end C/C++ extensions and C#.",
        "Existing code and production infrastructure were reused in developing installation programs for multiple UNIX, Linux, and Windows platforms. (bash, WIX). Used Microsoft Visual Studio and .NET Framework 4.5 and conversion from v3.",
        "Agile training was undertaken.",
        "Technologies included CVS, Perforce, Bugzilla, Review Board, Jenkins, Coverity, SAP with Oracle, DB2, MySQL, and SQLite. Also, HTML, CSS, XML, XSL, REST API, JSON, Javascript, some testing with Cassandra"
      ]
    },
    {
      "company": "Kelk Corporation",
      "location": "Toronto, ON",
      "title": "Lead Systems Analyst",
      "dates": "Jun ’11-Oct ‘12",
      "responsibilities": [
        "Industrial-grade sensor devices with management GUI programs were developed. Responsibilities comprised a team lead role providing design documentation and API definition conforming to an MVC architecture pattern. Additionally task definition, scheduling, and mentoring were undertaken. (PMLC)",
        "Achievements included creation of a portable C/C++ library based on existing proven functions with a Java API using JNI. This supported projects running on Linux, Windows, QNX, and Xilinx Microblaze.",
        "Accomplished enhancements to interrupt processing and thread signaling functions to increase performance handling asynchronous event processing and data uploading. This is a real-time embedded application involving Modbus, TCP/IP, and proprietary configuration management."
      ]
    },
    {
      "company": "Beta Systems Software of Canada",
      "location": "Toronto, ON",
      "title": "Software Security Engineering",
      "dates": "Jan ’09-Apr ‘11",
      "responsibilities": [
        "(Traded with Proginet Corp. - original position with Blockade Systems Corp. below)",
        "Program installed on a Windows client with invocation methods bound to service or credential provider event functions. Communications utilized an HTTP proxy. Security was provided using OpenSSL and PKI.",
        "Responsibilities included maintenance of security product lines providing authentication, authorization, and password management that were acquired by an asset trade with Proginet or purchase from Blockade",
        "Product enhancements were accomplished over two major releases. This involved port across multiple platforms including Linux, UNIX, z/OS, and Windows. Additional technologies include MFC, MSI, WIX, Perforce, SAP, OpenLDAP, AD, MS SQL, IIS, Javascript, HTML, CSS, XML, XSL, Javascript, SDLC."
      ]
    },
    {
      "company": "Proginet Corp.",
      "location": "Toronto, ON",
      "title": "Team Lead/Senior Developer",
      "dates": "Jun ’05-Jan ‘09",
      "responsibilities": [
        "(Purchased Blockade Systems Corp.)",
        "SaaS product providing a web application to manage email attachments was developed as a major contributor. Essentially the send functionality of an email application was required, including resolution of the recipients' list gained by a database query given a “to/cc/bcc” field entry.",
        "Implementation required HTTP encode and decode, including MIME content handling. Technologies included mySQL, AJAX, Javascript, Java, J2EE, Servlets, Struts, JDBC, Apache Tomcat, REST API",
        "Secure communications hub running on z/OS UNIX System Services was maintained and enhanced, including several critical bug fixes. This provides an HTTP, RADIUS, and TACACS+ server. Configuration management and synchronization transactions are handled by proprietary TCP and UDP messaging protocols. Additional technologies included SAP ABAP, Java, C/C++, SOAP"
      ]
    },
    {
      "company": "Lemontonic Inc.",
      "location": "Toronto, ON",
      "title": "Application Consultant",
      "dates": "Mar ’05-Jun ‘05",
      "responsibilities": [
        "Social networking web application was supported in a highly available production environment while ongoing enhancements were developed, and new features researched.",
        "Accomplishments included the development of business reporting and analysis applications. An email notification program involving database query was designed, optimized, implemented, and installed into production.",
        "Technologies included C#, PHP, ASP.Net, SharePoint, MySQL, SMTP, ETL."
      ]
    },
    {
      "company": "Blockade Systems Corp.",
      "location": "Toronto, ON",
      "title": "Team Lead Software R&D",
      "dates": "Nov ’99-Jan ‘05",
      "responsibilities": [
        "(Purchased by Proginet Corp.)",
        "Leading a team of developers and being responsible for design, interface definition, and project management, modules and agents for ManageID were developed that integrate an enterprise security server running on z/OS with security systems such as RACF, CA-ACF2, CA-TSS, AD, LDAP, NDS/eDir, PAM.",
        "High degree of interchangeability was designed and implemented as a plug-in module architecture. This supported the distribution of various agents using proprietary configuration and notification messaging protocols. An interchangeable Oracle, Microsoft SQL, or Access database module persists identities.",
        "Management agent (MA) for Microsoft Identity Integration Server (MIIS) and z/OS RACF was developed and optimized to perform well for a large-scale enterprise environment of a million users with C# .Net.",
        "Legacy code set was converged by refactor and reuse of functions with portable C/C++ classes and API. An embedded JVM architecture was implemented with a generic JNI interface and modular design.",
        "Responsible for formal design documents involving UML, TogetherSoft, Visio, and XML schema.",
        "Experience gained with J2EE compliant application servers; WebLogic, WebSphere, Apache Tomcat."
      ]
    },
    {
      "company": "Newhawk Computing",
      "location": "Mississauga, ON",
      "title": "Internet Worker",
      "dates": "Mar ’99-Nov ‘99",
      "responsibilities": [
        "Develop an enterprise portal facility and proprietary framework for self-help Internet service.",
        "Utilized C++, HTML, Javascript, OpenSSL, Sockets, WIN32, Pthreads, PKI, GCC, HTTP, TCP/IP.",
        "Code designed to port between POSIX operating systems such as Windows and Linux."
      ]
    },
    {
      "company": "Balisoft Technologies Inc.",
      "location": "Toronto, ON",
      "title": "Lead Software Developer",
      "dates": "Nov ‘98-Mar ’99",
      "responsibilities": [
        "Transfer technology from the foreign office; Solaris, Apache HTTPd, Sybase, Voxware, H.323, and C++.",
        "Investigate and prototype a customer service portal application, Email, COM/DCOM, Java, CGI.",
        "Extend the implementation of an email application integrating with Outlook internally and SMTP externally."
      ]
    },
    {
      "company": "Isolation Systems Ltd.",
      "location": "Etobicoke, ON",
      "title": "Principal Software Engineering",
      "dates": "Mar ‘97-Nov ’98",
      "responsibilities": [
        "(Purchased by Shiva Corp., then purchased by Intel)",
        "Develop a virtual private network (VPN) product with encryption, IP tunneling, firewall, and routing.",
        "Embedded implementation using Pharlap RTOS, WIN32, C++, Intel D100 Ethernet, and PC platform.",
        "Develop NDIS drivers for VPN client in Microsoft Windows NT/ 95/98 with encryption hardware.",
        "Implement virtual interface architecture providing IP tunneling with ARP, DHCP, and DNS protocols."
      ]
    },
    {
      "company": "IBM Canada",
      "location": "Markham, ON",
      "title": "Software Engineer",
      "dates": "Mar ‘95-Feb ’97",
      "responsibilities": [
        "Various contracts as an individual contributor were performed including numerous telephony-based projects.",
        "Projects were delivered for Canadian and international customers with requirements that included integration with voice mail systems, IVR, ACD, CTI, and other call center technologies.",
        "One project involved multiple sites in the US and Europe with a specific focus on middleware design and implementation using IBM MQSeries.",
        "Technologies used include Visual C++, VB, MFC, AIX, MQSeries, HP OpenView, LAN",
        "Analysis and improvement of internal project documentation were undertaken."
      ]
    }
  ]
}